CSI API ETABS v1
cPropMaterial.SetONoDesign Method
 Sets the other material property data for no design type materials.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetONoDesign(
	string Name,
	double FrictionAngle = 0,
	double DilatationalAngle = 0,
	double Temp = 0
)
Function SetONoDesign (
	Name As String,
	Optional FrictionAngle As Double = 0,
	Optional DilatationalAngle As Double = 0,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim FrictionAngle As Double
Dim DilatationalAngle As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.SetONoDesign(Name,
	FrictionAngle, DilatationalAngle,
	Temp)
int SetONoDesign(
	String^ Name,
	double FrictionAngle = 0,
	double DilatationalAngle = 0,
	double Temp = 0
)
abstract SetONoDesign :
        Name : string *
        ?FrictionAngle : float *
        ?DilatationalAngle : float *
        ?Temp : float
(* Defaults:
        let _FrictionAngle = defaultArg FrictionAngle 0
        let _DilatationalAngle = defaultArg DilatationalAngle 0
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing concrete material property.
FrictionAngle (Optional)
Type: System.Double
The Drucker-Prager friction angle. This item must be smaller or equal to 0 and less than 90. [deg]
DilatationalAngle (Optional)
Type: System.Double
The Drucker-Prager dilatational angle. This item must be smaller or equal to 0 and less than 90. [deg]
Temp (Optional)
Type: System.Double
The temperature at which the specified data applies. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("NoDesign", eMatType.NoDesign)
   'assign other properties
       ret = SapModel.PropMaterial.SetONoDesign(NoDesign", 10, 15)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace